open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_mic.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 on-board analog microphone capture — a shared NuttX audio
 * lower-half over the official Beken bk_aud_adc_* / bk_dma_* SDK APIs.
 * Register access is read-only and limited to checking that the immutable
 * SDK actually committed a channel configuration.  The selected physical-
 * board header supplies the fixed one- or two-microphone topology.
 *
 * Role ownership: AP only.  bk_aud_adc_*, ring_buffer_* and the audio
 * clock/power votes are compiled into the AP libdriver.a exclusively; the
 * CP bundle ships the headers but defines none of the symbols.
 *
 * Data path:
 *
 *   AUD ADC FIFO (0x47800044, L in [15:0] / R in [31:16])
 *     -> DMA_DEV_AUDIO_RX, DMA_WORK_MODE_REPEAT, 32-bit
 *       -> DMA ring buffer in DTCM (SDK RingBufferContext)
 *         -> DMA finish ISR posts a semaphore
 *           -> capture thread drains, de-interleaves, fills ap_buffer_s
 *             -> audio upper half via dev->upper(..., AUDIO_CALLBACK_DEQUEUE)
 *
 * Notes on SDK behaviour that shaped this driver (verified against the
 * v3.1.1.9 sources, not assumed):
 *
 *  1. bk_aud_adc_set_mic_mode() is a no-op on BK7258 because both single_en
 *     HAL bodies are empty.  Differential mode is nevertheless established
 *     by bk_aud_driver_init() through the ANA_REG19/ANA_REG27 defaults.
 *  2. bk_aud_set_ana_mic0_gain() drives ANA_REG19 == hardware MIC1;
 *     bk_aud_set_ana_mic1_gain() drives ANA_REG27 == hardware MIC2.
 *     CONFIG_SOC_BK7236XX is also selected for the BK7258 SDK bundle, so its
 *     common audio init programs both analog records even though the generic
 *     mic2_en HAL helper is empty.
 *  3. The ADC FIFO is always a 32-bit L/R word.  The current official
 *     onboard_mic_stream therefore initializes AUD_ADC_CHL_LR and uses a
 *     32-bit DMA for both stream formats.  Stereo preserves the raw
 *     MIC1/MIC2 pair.  Mono normally selects MIC1; a board may instead mark
 *     MIC2 as an AEC reference, in which case only the mono path consumes it
 *     through the optional chip-side preprocessor.
 *  4. Start order is DMA then ADC; stop order is DMA then ADC.
 *  5. ring_buffer_read() must run in task context: it re-reads the DMA
 *     destination write pointer and rewrites the DMA pause address, which
 *     is the back-pressure mechanism that stops the DMA from lapping the
 *     reader.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_MIC

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <inttypes.h>
#include <errno.h>
#include <debug.h>
#include <assert.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/queue.h>
#include <nuttx/kthread.h>
#include <nuttx/audio/audio.h>

#include <arch/chip/bk7258_mic.h>
#include <arch/chip/bk7258_pm.h>
#include <arch/chip/bk7258_psram.h>

/* SDK API headers.
 *
 * Deliberately NOT <driver/aud.h>: that header is stale CLI-only baggage
 * and declares a three-argument bk_aud_adc_init() that contradicts the
 * real single-argument definition in aud_adc_driver.c.
 */

#include <driver/aud_adc.h>
#include <driver/aud_adc_types.h>
#include <driver/aud_common.h>
#include <driver/audio_ring_buff.h>
#include <driver/dma.h>
#include <driver/dma_types.h>
#include <soc/reg_base.h>

#include "bk7258_media_root.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifndef CONFIG_BK7258_MIC_DEVNAME
#  define CONFIG_BK7258_MIC_DEVNAME     "pcm0c"
#endif

#define BK7258_MIC_DMA_UNIT_CHANNELS     8u
#define BK7258_MIC_DMA_UNIT_STRIDE       0x10000u
#define BK7258_MIC_DMA_CHANNEL_BASE      0x40u
#define BK7258_MIC_DMA_CHANNEL_STRIDE    0x40u
#define BK7258_MIC_DMA_CTRL_OFFSET       0x00u
#define BK7258_MIC_DMA_DEST_START_OFFSET 0x04u
#define BK7258_MIC_DMA_REQ_MUX_OFFSET    0x1cu

/* On BK7258 the pinned SDK occasionally returns BK_OK from bk_dma_init()
 * before its bulk channel configuration is visible in the DMA registers.
 * Later one-field setters still take effect, leaving a misleading channel
 * with transfer length / IRQ bits but no request mux or destination.  Verify
 * the immutable SDK's complete programming result and retry through its
 * public deinit/init contract instead of writing any register ourselves.
 *
 * The expected values are the BK7258 encoding of this driver's fixed setup:
 * repeat mode, 32-bit source/destination, increment+loop on both ends,
 * priority 1, AUDIO_RX -> DTCM.  Enable and interrupt-enable bits are omitted
 * from the control comparison because they are managed separately.
 */

#define BK7258_MIC_DMA_PROGRAM_ATTEMPTS  3u
#define BK7258_MIC_DMA_RETRY_DELAY_US    10u
#define BK7258_MIC_FIRST_DMA_TIMEOUT_US  100000u
#define BK7258_MIC_FIRST_DMA_POLL_US     1000u
#define BK7258_MIC_STOP_TIMEOUT_MS       1000u
#define BK7258_MIC_DMA_CTRL_CONFIG_MASK  0x00001ff8u
#define BK7258_MIC_DMA_CTRL_CONFIG_VALUE 0x00001fa8u
#define BK7258_MIC_DMA_CTRL_LENGTH_MASK  0xffff0000u
#define BK7258_MIC_DMA_REQ_MUX_MASK      0x3f7ff3ffu
#define BK7258_MIC_DMA_REQ_MUX_VALUE     0x0030000eu
#define BK7258_MIC_REQUIRED_CPU_HZ       480000000u

/* Frames of one channel carried per DMA completion.  The DMA transfer
 * length is derived from this and is always two channels wide because the
 * FIFO is interleaved.
 */

#ifndef CONFIG_BK7258_MIC_FRAME_SAMPLES
#  define CONFIG_BK7258_MIC_FRAME_SAMPLES 320
#endif

/* Number of frames the DMA ring can hold before the reader must catch up. */

#ifndef CONFIG_BK7258_MIC_RING_FRAMES
#  define CONFIG_BK7258_MIC_RING_FRAMES 4
#endif

#ifndef CONFIG_BK7258_MIC_PRIORITY
#  define CONFIG_BK7258_MIC_PRIORITY    150
#endif

#ifndef CONFIG_BK7258_MIC_STACKSIZE
#  define CONFIG_BK7258_MIC_STACKSIZE   2048
#endif

/* Always two 16-bit samples per FIFO word (left in the low half). */

#define BK7258_MIC_FIFO_CHANNELS        2u
#define BK7258_MIC_FIFO_WORD_BYTES      4u

