open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
/* One channel's worth of a frame, and the interleaved size the DMA moves. */

#define BK7258_MIC_FRAME_BYTES \
  (CONFIG_BK7258_MIC_FRAME_SAMPLES * BK7258_MIC_BYTES_PER_SAMPLE)

#define BK7258_MIC_DMA_FRAME_BYTES \
  (BK7258_MIC_FRAME_BYTES * BK7258_MIC_FIFO_CHANNELS)

/* The SDK requires the DMA pause address to differ from the loop end
 * address, so the ring is padded.  Mirrors DMA_CARRY_MIC_RINGBUF_SAFE_
 * INTERVAL in onboard_mic_record.c.
 */

#define BK7258_MIC_RING_GUARD_BYTES     8u

#define BK7258_MIC_RING_BYTES \
  ((BK7258_MIC_DMA_FRAME_BYTES * CONFIG_BK7258_MIC_RING_FRAMES) + \
   BK7258_MIC_RING_GUARD_BYTES)

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum bk7258_mic_state_e
{
  BK7258_MIC_STATE_RESET = 0,   /* Registered, hardware idle */
  BK7258_MIC_STATE_CONFIGURED,  /* configure() accepted a format */
  BK7258_MIC_STATE_RUNNING,     /* ADC + DMA streaming */
  BK7258_MIC_STATE_PAUSED       /* Streaming suspended, context retained */
};

struct bk7258_mic_dev_s
{
  struct audio_lowerhalf_s dev;        /* Must be first */

  /* Immutable physical-board contract supplied by board bring-up. */

  FAR const struct bk7258_mic_config_s *config;

  /* Negotiated format */

  uint32_t samplerate;
  uint8_t  channels;
  uint8_t  dig_gain;
  uint8_t  mic1_ana_gain;
  uint8_t  mic2_ana_gain;

  /* Beken DMA / ring-buffer context */

  dma_id_t          dma_id;
  bool              dma_allocated;
  dma_config_t      dma_config;
  uint8_t          *ring_mem;          /* DMA destination, kernel heap */
  RingBufferContext ring;
  bool              ring_valid;

  /* De-interleave scratch: one interleaved DMA frame */

  uint8_t          *scratch;
#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
  bool              preprocess_ready;
#endif

  /* Capture thread */

  pid_t             pid;
  sem_t             dmasem;            /* Posted by the DMA finish ISR */
  sem_t             donesem;           /* Posted as the thread exits */
  volatile bool     terminate;
  volatile bool     streaming;
  volatile uint32_t dma_isr_count;

  /* Serialize the capture worker against pause/stop.  Once pause returns,
   * no buffer callback from the pre-pause stream remains in flight.
   */

  mutex_t           worker_lock;

  enum bk7258_mic_state_e state;
  bool close_safe;
  bool reserved;
  bool frequency_voted;
  bool frequency_uncertain;
  bool audio_session_owned;

  /* Buffers queued by the upper half awaiting capture payload */

  struct dq_queue_s pendq;
  mutex_t           lock;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Hardware core layer */

static int  bk7258_mic_hw_setup(struct bk7258_mic_dev_s *priv);
static void bk7258_mic_hw_teardown(struct bk7258_mic_dev_s *priv);
static int  bk7258_mic_hw_start(struct bk7258_mic_dev_s *priv);
static void bk7258_mic_hw_stop(struct bk7258_mic_dev_s *priv);
static int  bk7258_mic_result(bk_err_t error);
static int  bk7258_mic_dma_program(struct bk7258_mic_dev_s *priv,
                                   const dma_config_t *config);
static void bk7258_mic_dma_isr(dma_id_t dma_id);

/* Capture thread */

static void bk7258_mic_deinterleave(int16_t *dest, const int16_t *src,
                                    unsigned int frames);
static int  bk7258_mic_capture_thread(int argc, char **argv);
static void bk7258_mic_flush_pending(struct bk7258_mic_dev_s *priv);
static int  bk7258_mic_stop_thread(struct bk7258_mic_dev_s *priv);

/* audio_ops_s */

static int  bk7258_mic_getcaps(struct audio_lowerhalf_s *dev, int type,
                               struct audio_caps_s *caps);
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int  bk7258_mic_configure(struct audio_lowerhalf_s *dev,
                                 void *session,
                                 const struct audio_caps_s *caps);
static int  bk7258_mic_start(struct audio_lowerhalf_s *dev, void *session);
static int  bk7258_mic_stop(struct audio_lowerhalf_s *dev, void *session);
static int  bk7258_mic_pause(struct audio_lowerhalf_s *dev, void *session);
static int  bk7258_mic_resume(struct audio_lowerhalf_s *dev, void *session);
static int  bk7258_mic_reserve(struct audio_lowerhalf_s *dev,
                               void **psession);
static int  bk7258_mic_release(struct audio_lowerhalf_s *dev,
                               void *session);
#else
static int  bk7258_mic_configure(struct audio_lowerhalf_s *dev,
                                 const struct audio_caps_s *caps);
static int  bk7258_mic_start(struct audio_lowerhalf_s *dev);
static int  bk7258_mic_stop(struct audio_lowerhalf_s *dev);
static int  bk7258_mic_pause(struct audio_lowerhalf_s *dev);
static int  bk7258_mic_resume(struct audio_lowerhalf_s *dev);
static int  bk7258_mic_reserve(struct audio_lowerhalf_s *dev);
static int  bk7258_mic_release(struct audio_lowerhalf_s *dev);
#endif
static int  bk7258_mic_shutdown(struct audio_lowerhalf_s *dev);
static int  bk7258_mic_enqueuebuffer(struct audio_lowerhalf_s *dev,
                                     struct ap_buffer_s *apb);
static int  bk7258_mic_cancelbuffer(struct audio_lowerhalf_s *dev,
                                    struct ap_buffer_s *apb);
static int  bk7258_mic_ioctl(struct audio_lowerhalf_s *dev, int cmd,
                             unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct audio_ops_s g_bk7258_mic_ops =
{
  .getcaps       = bk7258_mic_getcaps,
  .configure     = bk7258_mic_configure,
  .shutdown      = bk7258_mic_shutdown,
  .start         = bk7258_mic_start,
#ifndef CONFIG_AUDIO_EXCLUDE_STOP
  .stop          = bk7258_mic_stop,
#endif
#ifndef CONFIG_AUDIO_EXCLUDE_PAUSE_RESUME
  .pause         = bk7258_mic_pause,
  .resume        = bk7258_mic_resume,
#endif
  .enqueuebuffer = bk7258_mic_enqueuebuffer,
  .cancelbuffer  = bk7258_mic_cancelbuffer,
  .ioctl         = bk7258_mic_ioctl,
  .reserve       = bk7258_mic_reserve,
  .release       = bk7258_mic_release,
};

/* One on-board capture device: its negotiated stream may contain one or two
 * physical microphones.  The DMA finish ISR needs the static instance because
 * bk_dma_register_isr() takes no caller context.
 */

static struct bk7258_mic_dev_s g_bk7258_mic =
{
  .lock        = NXMUTEX_INITIALIZER,
  .worker_lock = NXMUTEX_INITIALIZER,
};

static bool g_bk7258_mic_registered;

/* The FIFO layout this driver de-interleaves against is fixed by the SoC:
 * REG_0x11 packs the left sample in [15:0] and the right in [31:16].
 */

_Static_assert(BK7258_MIC_BYTES_PER_SAMPLE * BK7258_MIC_FIFO_CHANNELS ==
               BK7258_MIC_FIFO_WORD_BYTES,
               "BK7258 AUD ADC FIFO must stay one 32-bit L/R sample pair");

_Static_assert((BK7258_MIC_DMA_FRAME_BYTES % BK7258_MIC_FIFO_WORD_BYTES)
               == 0,
               "BK7258 MIC DMA frame must be a whole number of FIFO words");

static bool bk7258_mic_has_aec_reference(
  FAR const struct bk7258_mic_config_s *config)
{
  return config != NULL &&
         (config->flags & BK7258_MIC_INPUT_MIC2_AEC_REFERENCE) != 0;
}

static bool bk7258_mic_preprocess_selected(
  FAR const struct bk7258_mic_dev_s *priv, uint8_t channels)
{
#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
  return channels == 1 && bk7258_mic_has_aec_reference(priv->config);
#else
  (void)priv;
  (void)channels;
  return false;
#endif
}

/****************************************************************************
 * Private Functions
 ****************************************************************************/

