open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
static uint32_t bk7258_mic_dma_reg(dma_id_t id, uint32_t offset)
{
  uintptr_t address = SOC_GENER_DMA_REG_BASE +
                      (id / BK7258_MIC_DMA_UNIT_CHANNELS) *
                        BK7258_MIC_DMA_UNIT_STRIDE +
                      BK7258_MIC_DMA_CHANNEL_BASE +
                      (id % BK7258_MIC_DMA_UNIT_CHANNELS) *
                        BK7258_MIC_DMA_CHANNEL_STRIDE + offset;

  return *(volatile uint32_t *)address;
}

static bool bk7258_mic_dma_program_valid(struct bk7258_mic_dev_s *priv,
                                         uint32_t *ctrl_out,
                                         uint32_t *req_mux_out,
                                         uint32_t *dest_start_out)
{
  uint32_t ctrl = bk7258_mic_dma_reg(priv->dma_id,
                                    BK7258_MIC_DMA_CTRL_OFFSET);
  uint32_t req_mux = bk7258_mic_dma_reg(priv->dma_id,
                                       BK7258_MIC_DMA_REQ_MUX_OFFSET);
  uint32_t dest_start = bk7258_mic_dma_reg(
    priv->dma_id, BK7258_MIC_DMA_DEST_START_OFFSET);
  uint32_t expected_length = (BK7258_MIC_DMA_FRAME_BYTES - 1u) << 16;

  *ctrl_out = ctrl;
  *req_mux_out = req_mux;
  *dest_start_out = dest_start;

  return (ctrl & BK7258_MIC_DMA_CTRL_CONFIG_MASK) ==
           BK7258_MIC_DMA_CTRL_CONFIG_VALUE &&
         (ctrl & BK7258_MIC_DMA_CTRL_LENGTH_MASK) == expected_length &&
         (req_mux & BK7258_MIC_DMA_REQ_MUX_MASK) ==
           BK7258_MIC_DMA_REQ_MUX_VALUE &&
         dest_start == (uint32_t)(uintptr_t)priv->ring_mem;
}

static int bk7258_mic_dma_program(struct bk7258_mic_dev_s *priv,
                                  const dma_config_t *config)
{
  uint32_t ctrl = 0;
  uint32_t req_mux = 0;
  uint32_t dest_start = 0;
  unsigned int attempt;
  bk_err_t err;
  int ret = -EIO;

  for (attempt = 1; attempt <= BK7258_MIC_DMA_PROGRAM_ATTEMPTS; attempt++)
    {
      err = bk_dma_init(priv->dma_id, config);
      if (err != BK_OK)
        {
          ret = bk7258_mic_result(err);
          goto retry_deinit;
        }

      err = bk_dma_set_transfer_len(priv->dma_id,
                                    BK7258_MIC_DMA_FRAME_BYTES);
      if (err != BK_OK)
        {
          ret = bk7258_mic_result(err);
          goto retry_deinit;
        }

      err = bk_dma_set_src_sec_attr(priv->dma_id, DMA_ATTR_SEC);
      if (err != BK_OK)
        {
          ret = bk7258_mic_result(err);
          goto retry_deinit;
        }

      err = bk_dma_set_dest_sec_attr(priv->dma_id, DMA_ATTR_SEC);
      if (err != BK_OK)
        {
          ret = bk7258_mic_result(err);
          goto retry_deinit;
        }

      err = bk_dma_register_isr(priv->dma_id, NULL, bk7258_mic_dma_isr);
      if (err != BK_OK)
        {
          ret = bk7258_mic_result(err);
          goto retry_deinit;
        }

      err = bk_dma_enable_finish_interrupt(priv->dma_id);
      if (err != BK_OK)
        {
          ret = bk7258_mic_result(err);
          goto retry_deinit;
        }

      UP_DSB();
      if (bk7258_mic_dma_program_valid(priv, &ctrl, &req_mux, &dest_start))
        {
          if (attempt > 1)
            {
              audwarn("WARNING: DMA%u configuration recovered on attempt %u\n",
                      (unsigned int)priv->dma_id, attempt);
            }

          return OK;
        }

      ret = -EIO;
      audwarn("WARNING: DMA%u configuration readback failed on attempt %u: "
              "ctrl=%08" PRIx32 " req=%08" PRIx32 " dst=%08" PRIx32 "\n",
              (unsigned int)priv->dma_id, attempt, ctrl, req_mux, dest_start);

retry_deinit:
      bk_dma_deinit(priv->dma_id);

      if (attempt < BK7258_MIC_DMA_PROGRAM_ATTEMPTS)
        {
          UP_DSB();
          up_udelay(BK7258_MIC_DMA_RETRY_DELAY_US);
        }
    }

  auderr("ERROR: DMA%u configuration failed after %u attempts: %d\n",
         (unsigned int)priv->dma_id, BK7258_MIC_DMA_PROGRAM_ATTEMPTS, ret);
  return ret;
}

/****************************************************************************
 * Name: bk7258_mic_result
 *
 * Description:
 *   Translate an SDK bk_err_t into a NuttX negated errno.
 *
 ****************************************************************************/

static int bk7258_mic_result(bk_err_t error)
{
  if (error == BK_OK)
    {
      return OK;
    }

  return -EIO;
}

/****************************************************************************
 * Name: bk7258_mic_dma_isr
 *
 * Description:
 *   Beken DMA finish callback.  Interrupt context: post the semaphore and
 *   return.  All ring-buffer work happens on the capture thread because
 *   ring_buffer_read() rewrites the DMA pause address.
 *
 *   dma_isr_t is void(*)(dma_id_t); the Beken samples cast this away with
 *   a (void *) at the registration site, which silently hides a prototype
 *   mismatch.  Match the real typedef instead so no cast is needed.
 *
 ****************************************************************************/

static void bk7258_mic_dma_isr(dma_id_t dma_id)
{
  struct bk7258_mic_dev_s *priv = &g_bk7258_mic;

  UNUSED(dma_id);

  __atomic_add_fetch(&priv->dma_isr_count, 1u, __ATOMIC_RELAXED);

  if (priv->streaming)
    {
      nxsem_post(&priv->dmasem);
    }
}

/****************************************************************************
 * Name: bk7258_mic_hw_setup
 *
 * Description:
 *   Bring up the AUD ADC and the capture DMA channel.  Mirrors the official
 *   onboard_mic_stream reference sequence.  Leaves both stopped.
 *
 ****************************************************************************/

static int bk7258_mic_hw_setup(struct bk7258_mic_dev_s *priv)
{
  aud_adc_config_t cfg = DEFAULT_AUD_ADC_CONFIG();
  dma_config_t dma_cfg;
  bool capture_both;
  uint32_t fifo_addr = 0;
  bk_err_t err;
  int ret;

  ret = bk7258_media_root_initialize(BK7258_MEDIA_ROOT_DMA);
  if (ret < 0)
    {
      auderr("ERROR: shared DMA root init failed: %d\n", ret);
      return ret;
    }

  /* The current official onboard_mic_stream explicitly opens L/R for both
   * one- and two-channel formats because the DMA must carry each packed
   * 32-bit FIFO word.  Mono selection happens when the worker discards R.
   */

  cfg.adc_chl       = AUD_ADC_CHL_LR;
  cfg.samp_rate     = priv->samplerate;
  cfg.adc_gain      = priv->dig_gain;
  cfg.adc_mode      = AUD_ADC_MODE_DIFFEN;
  cfg.adc_samp_edge = AUD_ADC_SAMP_EDGE_RISING;

  /* Keep the converter on the SDK onboard-mic reference clock.  The AP
   * libdriver.a is built for the secure audio domain and its production
   * stream selects XTAL here; APLL is not a board-level tuning knob.
   */

