open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
  cfg.clk_src       = AUD_CLK_XTAL;

  /* bk_aud_adc_init() performs the immutable common-driver initialization
   * internally.  Its SDK power/clock calls are local compatibility checks;
   * RESERVE already acquired the CP-owned composite AUDIO resource through
   * the NuttX audio-session boundary, where failures can be returned.
   */

  err = bk_aud_adc_init(&cfg);
  if (err != BK_OK)
    {
      auderr("ERROR: bk_aud_adc_init failed: %d\n", err);
      return bk7258_mic_result(err);
    }

  /* No-op on BK7258 (see file header note 1) but kept so the intent is
   * explicit and the code stays portable to parts where it is wired.
   */

  capture_both = priv->channels == 2 ||
                 bk7258_mic_preprocess_selected(priv, priv->channels);
  err = bk_aud_adc_set_mic_mode(capture_both ? AUD_MIC_BOTH : AUD_MIC_MIC1,
                                AUD_ADC_MODE_DIFFEN);
  if (err != BK_OK)
    {
      auderr("ERROR: bk_aud_adc_set_mic_mode failed: %d\n", err);
      ret = bk7258_mic_result(err);
      goto err_adc;
    }

  /* ana_mic0 == ANA_REG19 == hardware MIC1 == MICP1/MICN1. */

  err = bk_aud_set_ana_mic0_gain(priv->mic1_ana_gain);
  if (err != BK_OK)
    {
      auderr("ERROR: bk_aud_set_ana_mic0_gain failed: %d\n", err);
      ret = bk7258_mic_result(err);
      goto err_adc;
    }

  /* ana_mic1 == ANA_REG27 == hardware MIC2 == MICP2/MICN2. */

  if (capture_both)
    {
      err = bk_aud_set_ana_mic1_gain(priv->mic2_ana_gain);
      if (err != BK_OK)
        {
          auderr("ERROR: bk_aud_set_ana_mic1_gain failed: %d\n", err);
          ret = bk7258_mic_result(err);
          goto err_adc;
        }
    }

  /* DMA destination ring, plus the de-interleave scratch frame. */

#ifdef CONFIG_BK7258_PSRAM
  /* Match the official onboard_mic_stream allocation domain.  Its
   * audio_dma_mem_calloc() resolves to psram_malloc() in the pinned AP SDK.
   * The NuttX kernel heap can extend into shared SMEM4 (0x2808xxxx), where
   * this DMA request drops enable before moving its destination pointer.
   * The board PSRAM heap is non-cacheable and is the SDK's intended audio
   * DMA storage on this profile.
   */

  priv->ring_mem = bk7258_psram_zalloc(BK7258_MIC_RING_BYTES);
#else
  priv->ring_mem = kmm_zalloc(BK7258_MIC_RING_BYTES);
#endif
  if (priv->ring_mem == NULL)
    {
      ret = -ENOMEM;
      goto err_adc;
    }

  priv->scratch = kmm_malloc(BK7258_MIC_DMA_FRAME_BYTES);
  if (priv->scratch == NULL)
    {
      ret = -ENOMEM;
      goto err_ring_mem;
    }

#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
  if (bk7258_mic_preprocess_selected(priv, priv->channels))
    {
      struct bk7258_audio_preprocess_config_s preprocess =
      {
        .sample_rate = priv->samplerate,
        .frame_samples = CONFIG_BK7258_MIC_FRAME_SAMPLES,
        .aec_delay_samples = priv->config->aec_delay_samples,
      };

      ret = bk7258_audio_preprocess_initialize(&preprocess);
      if (ret < 0)
        {
          auderr("ERROR: audio preprocessor initialization failed: %d\n",
                 ret);
          goto err_scratch;
        }

      priv->preprocess_ready = true;
    }
#endif

  /* The API comment says "> DMA_ID_MAX", but every official v3.1.1.9
   * audio caller treats DMA_ID_MAX as the failure sentinel.  Follow the
   * executable SDK usage, not the inconsistent prose.
   */

  priv->dma_id = bk_dma_alloc(DMA_DEV_AUDIO);
  if (priv->dma_id < DMA_ID_0 || priv->dma_id >= DMA_ID_MAX)
    {
      auderr("ERROR: bk_dma_alloc(DMA_DEV_AUDIO) exhausted\n");
      ret = -EBUSY;
      goto err_scratch;
    }

  priv->dma_allocated = true;

  err = bk_aud_adc_get_fifo_addr(&fifo_addr);
  if (err != BK_OK)
    {
      auderr("ERROR: bk_aud_adc_get_fifo_addr failed: %d\n", err);
      ret = bk7258_mic_result(err);
      goto err_dma_alloc;
    }

  memset(&dma_cfg, 0, sizeof(dma_cfg));

  dma_cfg.mode      = DMA_WORK_MODE_REPEAT;
  dma_cfg.chan_prio = 1;

  dma_cfg.src.dev         = DMA_DEV_AUDIO_RX;
  dma_cfg.src.width       = DMA_DATA_WIDTH_32BITS;
  dma_cfg.src.start_addr  = fifo_addr;
  dma_cfg.src.end_addr    = fifo_addr + BK7258_MIC_FIFO_WORD_BYTES;
  dma_cfg.src.addr_inc_en = DMA_ADDR_INC_ENABLE;
  dma_cfg.src.addr_loop_en = DMA_ADDR_LOOP_ENABLE;

  dma_cfg.dst.dev         = DMA_DEV_DTCM;
  dma_cfg.dst.width       = DMA_DATA_WIDTH_32BITS;
  dma_cfg.dst.start_addr  = (uint32_t)(uintptr_t)priv->ring_mem;
  dma_cfg.dst.end_addr    = (uint32_t)(uintptr_t)priv->ring_mem +
                            BK7258_MIC_RING_BYTES;
  dma_cfg.dst.addr_inc_en = DMA_ADDR_INC_ENABLE;
  dma_cfg.dst.addr_loop_en = DMA_ADDR_LOOP_ENABLE;

  priv->dma_config = dma_cfg;

  /* This immutable AP libdriver.a was built with CONFIG_SPE=1: its DMA
   * driver registers INT_SRC_GDMA / INT_SRC_DMA1_SEC, and the official
   * onboard-mic stream marks both ends secure.  A NuttX-only conditional
   * cannot reproduce that archive-time setting; omitting these attributes
   * accepts setup but the audio FIFO never completes a transfer.
   */

  ret = bk7258_mic_dma_program(priv, &dma_cfg);
  if (ret < 0)
    {
      goto err_dma_alloc;
    }

  /* RB_DMA_TYPE_WRITE: the DMA is the producer.  ring_buffer_read() will
   * pull the write pointer straight out of the DMA registers and push back
   * on the DMA by moving its pause address.
   */

  ring_buffer_init(&priv->ring, priv->ring_mem, BK7258_MIC_RING_BYTES,
                   priv->dma_id, RB_DMA_TYPE_WRITE);
  priv->ring_valid = true;

  audinfo("AUD ADC ready: %" PRIu32 " Hz, %u ch, dig 0x%02x, "
          "ana 0x%02x/0x%02x\n",
          priv->samplerate, priv->channels, priv->dig_gain,
          priv->mic1_ana_gain, priv->mic2_ana_gain);

  return OK;

err_dma_alloc:
  bk_dma_free(DMA_DEV_AUDIO, priv->dma_id);
  priv->dma_allocated = false;

err_scratch:
#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
  if (priv->preprocess_ready)
    {
      bk7258_audio_preprocess_deinitialize();
      priv->preprocess_ready = false;
    }
#endif
  kmm_free(priv->scratch);
  priv->scratch = NULL;

err_ring_mem:
#ifdef CONFIG_BK7258_PSRAM
  bk7258_psram_free(priv->ring_mem);
#else
  kmm_free(priv->ring_mem);
#endif
  priv->ring_mem = NULL;

