open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
err_adc:
  bk_aud_adc_deinit();
  return ret;
}

/****************************************************************************
 * Name: bk7258_mic_hw_teardown
 *
 * Description:
 *   Release everything bk7258_mic_hw_setup() acquired.  Safe to call when
 *   setup never ran or partially failed.
 *
 ****************************************************************************/

static void bk7258_mic_hw_teardown(struct bk7258_mic_dev_s *priv)
{
  if (priv->ring_valid)
    {
      /* ring_buffer_clear() updates DMA producer/pause pointers.  It must
       * run before the DMA channel is deinitialized and returned.
       */

      ring_buffer_clear(&priv->ring);
      priv->ring_valid = false;
    }

  if (priv->dma_allocated)
    {
      bk_dma_deinit(priv->dma_id);
      bk_dma_free(DMA_DEV_AUDIO, priv->dma_id);
      priv->dma_allocated = false;
    }

  /* bk_aud_adc_deinit() stops the ADC first, then drops the audio power
   * vote through bk_aud_driver_deinit(), which is reference counted and so
   * will not tear down a DAC that is still in use.
   */

  bk_aud_adc_deinit();

#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
  if (priv->preprocess_ready)
    {
      bk7258_audio_preprocess_deinitialize();
      priv->preprocess_ready = false;
    }
#endif

  kmm_free(priv->scratch);
  priv->scratch = NULL;

#ifdef CONFIG_BK7258_PSRAM
  bk7258_psram_free(priv->ring_mem);
#else
  kmm_free(priv->ring_mem);
#endif
  priv->ring_mem = NULL;
}

/****************************************************************************
 * Name: bk7258_mic_hw_start / bk7258_mic_hw_stop
 *
 * Description:
 *   Order matters and matches the Beken reference: DMA before ADC on the
 *   way up so no samples are produced before there is somewhere to put
 *   them, and DMA before ADC on the way down so the transport is cut before
 *   the source.
 *
 ****************************************************************************/

static int bk7258_mic_hw_start(struct bk7258_mic_dev_s *priv)
{
  uint32_t ctrl;
  uint32_t req_mux;
  uint32_t dest_start;
  uint32_t waited_us;
  bk_err_t err;
  int ret;

  /* Reset the read/write pointers and push the DMA pause address out to the
   * end of the ring; without this a resume replays stale pointers.
   */

  ring_buffer_clear(&priv->ring);

  /* The upper half creates its capture worker between hardware setup and
   * start.  Recheck at the last safe point before enabling the channel so a
   * late DMA-domain reset cannot turn into a three-second receive timeout.
   * A bad readback is repaired through the same public deinit/init sequence;
   * ring_buffer_clear() is repeated because deinit resets the pause address.
   */

  UP_DSB();
  if (!bk7258_mic_dma_program_valid(priv, &ctrl, &req_mux, &dest_start))
    {
      audwarn("WARNING: DMA%u configuration lost before start: "
              "ctrl=%08" PRIx32 " req=%08" PRIx32 " dst=%08" PRIx32 "\n",
              (unsigned int)priv->dma_id, ctrl, req_mux, dest_start);
      bk_dma_deinit(priv->dma_id);
      UP_DSB();
      up_udelay(BK7258_MIC_DMA_RETRY_DELAY_US);

      ret = bk7258_mic_dma_program(priv, &priv->dma_config);
      if (ret < 0)
        {
          return ret;
        }

      ring_buffer_clear(&priv->ring);
      UP_DSB();
      if (!bk7258_mic_dma_program_valid(priv, &ctrl, &req_mux, &dest_start))
        {
          auderr("ERROR: DMA%u configuration lost after start recovery: "
                 "ctrl=%08" PRIx32 " req=%08" PRIx32 " dst=%08" PRIx32
                 "\n", (unsigned int)priv->dma_id, ctrl, req_mux,
                 dest_start);
          return -EIO;
        }
    }

  if (priv->config->set_capture_quiet != NULL)
    {
      ret = priv->config->set_capture_quiet(true);
      if (ret < 0)
        {
          return ret;
        }
    }

  /* START and RESUME must both observe a completion from this activation. */

  __atomic_store_n(&priv->dma_isr_count, 0, __ATOMIC_RELEASE);
  err = bk_dma_start(priv->dma_id);
  if (err != BK_OK)
    {
      auderr("ERROR: bk_dma_start failed: %d\n", err);
      bk7258_mic_hw_stop(priv);
      return bk7258_mic_result(err);
    }

  err = bk_aud_adc_start();
  if (err != BK_OK)
    {
      auderr("ERROR: bk_aud_adc_start failed: %d\n", err);
      bk7258_mic_hw_stop(priv);
      return bk7258_mic_result(err);
    }

  /* One DMA frame is 20 ms at a 16 kHz capture rate.  Require proof
   * that the SDK's GDMA ISR reached this driver, but return as soon as the
   * first completion arrives.  The audio upper half cannot start the
   * recorder's queue consumer until this lower-half start call returns.  A
   * fixed 100-ms sleep can otherwise fill that bounded queue before its
   * consumer exists and stall the callback path.
   */

  for (waited_us = 0;
       __atomic_load_n(&priv->dma_isr_count, __ATOMIC_ACQUIRE) == 0 &&
       waited_us < BK7258_MIC_FIRST_DMA_TIMEOUT_US;
       waited_us += BK7258_MIC_FIRST_DMA_POLL_US)
    {
      (void)nxsig_usleep(BK7258_MIC_FIRST_DMA_POLL_US);
    }

  if (__atomic_load_n(&priv->dma_isr_count, __ATOMIC_ACQUIRE) == 0)
    {
      auderr("ERROR: DMA%u first completion timed out after %u us\n",
             (unsigned int)priv->dma_id,
             (unsigned int)BK7258_MIC_FIRST_DMA_TIMEOUT_US);
      bk7258_mic_hw_stop(priv);
      return -ETIMEDOUT;
    }

  return OK;
}

static void bk7258_mic_hw_stop(struct bk7258_mic_dev_s *priv)
{
  bk_err_t dma_ret = bk_dma_stop(priv->dma_id);
  bk_err_t adc_ret = bk_aud_adc_stop();

  /* Keep the board quiet if the hardware has not confirmed capture stopped.
   * A later successful STOP may release the interlock.
   */

  if (dma_ret == BK_OK && adc_ret == BK_OK &&
      priv->config->set_capture_quiet != NULL)
    {
      (void)priv->config->set_capture_quiet(false);
    }
}

/****************************************************************************
 * Name: bk7258_mic_deinterleave
 *
 * Description:
 *   Collapse an interleaved L/R block down to the left channel only, which
 *   is hardware MIC1.  Matches the reference loop ptr[i] = ptr[2 * i].
 *
 ****************************************************************************/

static void bk7258_mic_deinterleave(int16_t *dest, const int16_t *src,
                                    unsigned int frames)
{
  unsigned int i;

