open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
  for (i = 0; i < frames; i++)
    {
      dest[i] = src[2 * i];
    }
}

/****************************************************************************
 * Name: bk7258_mic_flush_pending
 *
 * Description:
 *   Hand every still-queued buffer back to the upper half so a waiting
 *   thread is not stranded when capture stops.
 *
 ****************************************************************************/

static void bk7258_mic_flush_pending(struct bk7258_mic_dev_s *priv)
{
  struct ap_buffer_s *apb;

  nxmutex_lock(&priv->lock);

  while ((apb = (struct ap_buffer_s *)dq_remfirst(&priv->pendq)) != NULL)
    {
      nxmutex_unlock(&priv->lock);

      apb->nbytes  = 0;
      apb->curbyte = 0;
      apb->flags  |= AUDIO_APB_FINAL;

#ifdef CONFIG_AUDIO_MULTI_SESSION
      priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK,
                      priv);
#else
      priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK);
#endif

      nxmutex_lock(&priv->lock);
    }

  nxmutex_unlock(&priv->lock);
}

/****************************************************************************
 * Name: bk7258_mic_capture_thread
 *
 * Description:
 *   Drain the DMA ring into upper-half buffers.  Runs in task context
 *   because ring_buffer_read() touches DMA registers.
 *
 ****************************************************************************/

static int bk7258_mic_capture_thread(int argc, char **argv)
{
  struct bk7258_mic_dev_s *priv = &g_bk7258_mic;
  struct ap_buffer_s *apb;
  unsigned int frames;
  uint32_t fill;
  uint32_t got;

  while (!priv->terminate)
    {
      if (nxsem_wait_uninterruptible(&priv->dmasem) < 0)
        {
          continue;
        }

      if (priv->terminate)
        {
          break;
        }

      /* Pause/stop serialize their hardware transition through worker_lock
       * and clear streaming before releasing it.  Recheck after taking the
       * lock so a pre-pause semaphore cannot produce a late callback.
       */

      nxmutex_lock(&priv->worker_lock);

      if (priv->terminate || !priv->streaming)
        {
          nxmutex_unlock(&priv->worker_lock);
          continue;
        }

      /* Only consume a frame once the DMA has actually landed one. */

      fill = ring_buffer_get_fill_size(&priv->ring);
      if (fill < BK7258_MIC_DMA_FRAME_BYTES)
        {
          nxmutex_unlock(&priv->worker_lock);
          continue;
        }

      got = ring_buffer_read(&priv->ring, priv->scratch,
                             BK7258_MIC_DMA_FRAME_BYTES);
      if (got == 0)
        {
          nxmutex_unlock(&priv->worker_lock);
          continue;
        }

      /* Whole L/R pairs only. */

      frames = got / BK7258_MIC_FIFO_WORD_BYTES;
      if (frames == 0)
        {
          nxmutex_unlock(&priv->worker_lock);
          continue;
        }

      nxmutex_lock(&priv->lock);
      apb = (struct ap_buffer_s *)dq_remfirst(&priv->pendq);
      nxmutex_unlock(&priv->lock);

      if (apb == NULL)
        {
          /* No consumer buffer available; the samples are dropped rather
           * than stalling the DMA and corrupting the stream timing.
           */

          audwarn("WARNING: no queued buffer, dropped %u frames\n", frames);
          nxmutex_unlock(&priv->worker_lock);
          continue;
        }

      if (priv->channels == 1)
        {
          unsigned int capacity = apb->nmaxbytes /
                                  BK7258_MIC_BYTES_PER_SAMPLE;
          int preprocess_ret = -ENODEV;

          if (frames > capacity)
            {
              frames = capacity;
            }

#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
          if (priv->preprocess_ready)
            {
              preprocess_ret = bk7258_audio_preprocess_process(
                (const int16_t *)priv->scratch, frames,
                (int16_t *)apb->samp);
              if (preprocess_ret < 0)
                {
                  audwarn("WARNING: audio preprocess failed, raw MIC1 "
                          "fallback: %d\n", preprocess_ret);
                }
            }
#endif

          if (preprocess_ret < 0)
            {
              bk7258_mic_deinterleave((int16_t *)apb->samp,
                                      (const int16_t *)priv->scratch,
                                      frames);
            }

          apb->nbytes = frames * BK7258_MIC_BYTES_PER_SAMPLE;
        }
      else
        {
          if (got > apb->nmaxbytes)
            {
              got = apb->nmaxbytes;
            }

          memcpy(apb->samp, priv->scratch, got);
          apb->nbytes = got;
        }

      apb->curbyte  = 0;
      apb->nsamples = frames;

      {
        bool final = (apb->flags & AUDIO_APB_FINAL) != 0;

#ifdef CONFIG_AUDIO_MULTI_SESSION
        priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK,
                        priv);
#else
        priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb, OK);
#endif

        if (final)
          {
#ifdef CONFIG_AUDIO_MULTI_SESSION
            priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_COMPLETE,
                            NULL, OK, priv);
#else
            priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_COMPLETE,
                            NULL, OK);
#endif
          }
      }

      nxmutex_unlock(&priv->worker_lock);
    }

  bk7258_mic_flush_pending(priv);

  audinfo("Capture thread exiting\n");

  /* Must be the very last action.  bk7258_mic_stop_thread() frees the ring
   * and the scratch frame as soon as this is posted, and it — not this
   * thread — clears priv->pid, so that the "is a thread running" test and
   * the handshake can never disagree.
   */

  nxsem_post(&priv->donesem);
  return 0;
}

/****************************************************************************
 * Name: bk7258_mic_stop_thread
 *
 * Description:
 *   Ask the capture thread to exit and block until it has, so that the
 *   caller can safely release the ring buffer and scratch frame the thread
 *   dereferences.  Safe to call when no thread is running.
 *
 ****************************************************************************/

static int bk7258_mic_stop_thread(struct bk7258_mic_dev_s *priv)
{
  int ret;

  if (priv->pid < 0)
    {
      return OK;
    }

  priv->streaming = false;
  priv->terminate = true;

