open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
  /* Wake the thread out of its wait for the next DMA completion. */

  nxsem_post(&priv->dmasem);
  ret = nxsem_tickwait_uninterruptible(
    &priv->donesem, MSEC2TICK(BK7258_MIC_STOP_TIMEOUT_MS));
  if (ret < 0)
    {
      auderr("ERROR: capture thread stop timed out: pid=%d ret=%d\n",
             priv->pid, ret);
      return ret;
    }

  priv->pid = -1;
  return OK;
}

/****************************************************************************
 * Private: audio lower-half operations
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_mic_getcaps
 ****************************************************************************/

static int bk7258_mic_getcaps(struct audio_lowerhalf_s *dev, int type,
                              struct audio_caps_s *caps)
{
  if (caps == NULL || caps->ac_len < sizeof(struct audio_caps_s))
    {
      return -EINVAL;
    }

  caps->ac_format.hw  = 0;
  caps->ac_controls.w = 0;

  switch (caps->ac_type)
    {
      case AUDIO_TYPE_QUERY:

        /* Capture only. */

        caps->ac_channels = g_bk7258_mic.config->channels;

        switch (caps->ac_subtype)
          {
            case AUDIO_TYPE_QUERY:
              caps->ac_controls.b[0] = AUDIO_TYPE_INPUT |
                                       AUDIO_TYPE_FEATURE;
              caps->ac_format.hw = 1 << (AUDIO_FMT_PCM - 1);
              break;

            default:
              caps->ac_controls.b[0] = AUDIO_SUBFMT_END;
              break;
          }
        break;

      case AUDIO_TYPE_INPUT:
        caps->ac_channels = g_bk7258_mic.config->channels;

        switch (caps->ac_subtype)
          {
            case AUDIO_TYPE_QUERY:

              caps->ac_controls.hw[0] = AUDIO_SAMP_RATE_8K |
                                        AUDIO_SAMP_RATE_11K |
                                        AUDIO_SAMP_RATE_12K |
                                        AUDIO_SAMP_RATE_16K |
                                        AUDIO_SAMP_RATE_22K |
                                        AUDIO_SAMP_RATE_24K |
                                        AUDIO_SAMP_RATE_32K |
                                        AUDIO_SAMP_RATE_44K |
                                        AUDIO_SAMP_RATE_48K;
              break;

            default:
              break;
          }
        break;

      case AUDIO_TYPE_FEATURE:
        caps->ac_channels = g_bk7258_mic.config->channels;
        if (caps->ac_subtype == AUDIO_FU_UNDEF)
          {
            caps->ac_controls.b[0] = AUDIO_FU_VOLUME;
          }
        break;

      default:
        caps->ac_subtype = 0;
        caps->ac_channels = 0;
        break;
    }

  (void)dev;
  (void)type;
  return caps->ac_len;
}

/****************************************************************************
 * Name: bk7258_mic_configure
 ****************************************************************************/

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_mic_configure(struct audio_lowerhalf_s *dev,
                                void *session,
                                const struct audio_caps_s *caps)
#else
static int bk7258_mic_configure(struct audio_lowerhalf_s *dev,
                                const struct audio_caps_s *caps)
#endif
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  int ret = OK;

  DEBUGASSERT(priv != NULL && caps != NULL);

  switch (caps->ac_type)
    {
      case AUDIO_TYPE_INPUT:
        {
          uint32_t rate = caps->ac_controls.hw[0] |
                          (caps->ac_controls.b[3] << 16);
          uint8_t  channels = caps->ac_channels;
          uint8_t  bits = caps->ac_controls.b[2];

          if (bits != BK7258_MIC_BITS_PER_SAMPLE)
            {
              auderr("ERROR: only %u-bit PCM is supported, got %u\n",
                     BK7258_MIC_BITS_PER_SAMPLE, bits);
              return -EINVAL;
            }

          if (channels < 1 || channels > priv->config->channels)
            {
              auderr("ERROR: board %s supports 1..%u microphone channels, "
                     "got %u\n",
                     priv->config->variant_name != NULL ?
                       priv->config->variant_name : "unknown",
                     priv->config->channels, channels);
              return -EINVAL;
            }

          switch (rate)
            {
              case BK7258_MIC_RATE_8000:
              case BK7258_MIC_RATE_11025:
              case BK7258_MIC_RATE_12000:
              case BK7258_MIC_RATE_16000:
              case BK7258_MIC_RATE_22050:
              case BK7258_MIC_RATE_24000:
              case BK7258_MIC_RATE_32000:
              case BK7258_MIC_RATE_44100:
              case BK7258_MIC_RATE_48000:
                break;

              default:
                auderr("ERROR: unsupported sample rate %" PRIu32 "\n",
                       rate);
                return -EINVAL;
            }

#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
          if (bk7258_mic_preprocess_selected(priv, channels) &&
              (rate != BK7258_AUDIO_PREPROCESS_RATE ||
               CONFIG_BK7258_MIC_FRAME_SAMPLES !=
                 BK7258_AUDIO_PREPROCESS_FRAME_SAMPLES))
            {
              auderr("ERROR: processed mono requires %u Hz/%u samples, "
                     "got %" PRIu32 " Hz/%u samples\n",
                     BK7258_AUDIO_PREPROCESS_RATE,
                     BK7258_AUDIO_PREPROCESS_FRAME_SAMPLES, rate,
                     CONFIG_BK7258_MIC_FRAME_SAMPLES);
              return -ENOTSUP;
            }
#endif

          nxmutex_lock(&priv->lock);

          if (priv->state == BK7258_MIC_STATE_RUNNING ||
              priv->state == BK7258_MIC_STATE_PAUSED)
            {
              nxmutex_unlock(&priv->lock);
              return -EBUSY;
            }

          priv->samplerate = rate;
          priv->channels   = channels;
          priv->state      = BK7258_MIC_STATE_CONFIGURED;

          nxmutex_unlock(&priv->lock);

