open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
          audinfo("Configured %" PRIu32 " Hz, %u ch, %u bits\n",
                  rate, channels, bits);
        }
        break;

      case AUDIO_TYPE_FEATURE:
        {
          uint16_t volume;
          uint8_t gain;
          bool hardware_active;
          bk_err_t error = BK_OK;

          if (caps->ac_format.hw != AUDIO_FU_VOLUME)
            {
              return -ENOTTY;
            }

          volume = caps->ac_controls.hw[0];
          if (volume > AUDIO_VOLUME_MAX)
            {
              return -ERANGE;
            }

          gain = (uint8_t)((volume * BK7258_MIC_DIG_GAIN_MAX +
                            AUDIO_VOLUME_MAX / 2u) /
                           AUDIO_VOLUME_MAX);
          ret = nxmutex_lock(&priv->lock);
          if (ret < 0)
            {
              return ret;
            }

          hardware_active = priv->state == BK7258_MIC_STATE_RUNNING ||
                            priv->state == BK7258_MIC_STATE_PAUSED;
          if (hardware_active)
            {
              error = bk_aud_adc_set_gain(gain);
            }

          if (error == BK_OK)
            {
              priv->dig_gain = gain;
              ret = OK;
            }
          else
            {
              ret = bk7258_mic_result(error);
            }

          nxmutex_unlock(&priv->lock);
        }
        break;

      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: bk7258_mic_start
 ****************************************************************************/

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_mic_start(struct audio_lowerhalf_s *dev, void *session)
#else
static int bk7258_mic_start(struct audio_lowerhalf_s *dev)
#endif
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  int stop_ret;
  int ret;

  DEBUGASSERT(priv != NULL);

  if (!priv->reserved || !priv->frequency_voted ||
      priv->frequency_uncertain || !priv->audio_session_owned)
    {
      auderr("ERROR: start denied: reserved=%d frequency=%d/%d "
             "audio_session=%d state=%d\n",
             priv->reserved, priv->frequency_voted,
             priv->frequency_uncertain, priv->audio_session_owned,
             priv->state);
      return -EACCES;
    }

  if (priv->state == BK7258_MIC_STATE_RUNNING)
    {
      return OK;
    }

  if (priv->state != BK7258_MIC_STATE_CONFIGURED)
    {
      auderr("ERROR: start before configure\n");
      return -EINVAL;
    }

  ret = bk7258_mic_hw_setup(priv);
  if (ret < 0)
    {
      return ret;
    }

  priv->terminate = false;
  priv->streaming = true;

  /* Discard completions left over by the previous run, otherwise the new
   * capture thread wakes for frames that are no longer in the ring.
   */

  while (nxsem_trywait(&priv->dmasem) >= 0);

  /* The capture thread reaches the state through the static singleton, the
   * same way the DMA ISR must, so no argv marshalling is needed.
   */

  ret = kthread_create("bk7258_mic", CONFIG_BK7258_MIC_PRIORITY,
                       CONFIG_BK7258_MIC_STACKSIZE,
                       bk7258_mic_capture_thread, NULL);
  if (ret < 0)
    {
      auderr("ERROR: kthread_create failed: %d\n", ret);
      priv->streaming = false;
      bk7258_mic_hw_teardown(priv);
      return ret;
    }

  priv->pid = (pid_t)ret;
  ret = bk7258_mic_hw_start(priv);
  if (ret < 0)
    {
      stop_ret = bk7258_mic_stop_thread(priv);
      if (stop_ret < 0)
        {
          /* Retain the setup and expose an active state so RELEASE retries
           * the bounded stop instead of tearing memory out from under a task
           * that may still reference it.
           */

          priv->state = BK7258_MIC_STATE_RUNNING;
          return stop_ret;
        }

      bk7258_mic_hw_teardown(priv);
      return ret;
    }

  priv->state = BK7258_MIC_STATE_RUNNING;
  audinfo("Capture started\n");

  return OK;
}

/****************************************************************************
 * Name: bk7258_mic_stop
 ****************************************************************************/

#ifndef CONFIG_AUDIO_EXCLUDE_STOP
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_mic_stop(struct audio_lowerhalf_s *dev, void *session)
#else
static int bk7258_mic_stop(struct audio_lowerhalf_s *dev)
#endif
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  bool pending;
  int ret;

  DEBUGASSERT(priv != NULL);

  if (priv->state != BK7258_MIC_STATE_RUNNING &&
      priv->state != BK7258_MIC_STATE_PAUSED)
    {
      nxmutex_lock(&priv->lock);
      pending = dq_peek(&priv->pendq) != NULL;
      nxmutex_unlock(&priv->lock);
      if (pending)
        {
          nxmutex_lock(&priv->worker_lock);
          bk7258_mic_flush_pending(priv);
          nxmutex_unlock(&priv->worker_lock);

#ifdef CONFIG_AUDIO_MULTI_SESSION
          priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_COMPLETE, NULL,
                          OK, priv);
#else
          priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_COMPLETE, NULL, OK);
#endif
        }

      return OK;
    }

  /* The worker's ring_buffer_read() also touches DMA producer/pause
   * registers.  Quiesce it before stopping those registers underneath it.
   */

  ret = nxmutex_timedlock(&priv->worker_lock,
                          BK7258_MIC_STOP_TIMEOUT_MS);
  if (ret < 0)
    {
      return ret;
    }

  priv->streaming = false;
  bk7258_mic_hw_stop(priv);
  nxmutex_unlock(&priv->worker_lock);
  /* Join before teardown: the thread dereferences the ring and the scratch
   * frame that bk7258_mic_hw_teardown() is about to free.
   */

  ret = bk7258_mic_stop_thread(priv);
  if (ret < 0)
    {
      return ret;
    }

  bk7258_mic_hw_teardown(priv);

  priv->state = BK7258_MIC_STATE_CONFIGURED;
#ifdef CONFIG_AUDIO_MULTI_SESSION
  priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_COMPLETE, NULL, OK, priv);
#else
  priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_COMPLETE, NULL, OK);
#endif

  audinfo("Capture stopped\n");

  return OK;
}
#endif

/****************************************************************************
 * Name: bk7258_mic_pause / bk7258_mic_resume
 ****************************************************************************/

#ifndef CONFIG_AUDIO_EXCLUDE_PAUSE_RESUME
#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_mic_pause(struct audio_lowerhalf_s *dev, void *session)
#else
static int bk7258_mic_pause(struct audio_lowerhalf_s *dev)
#endif
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;

  DEBUGASSERT(priv != NULL);

