open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
  if (priv->state != BK7258_MIC_STATE_RUNNING)
    {
      return OK;
    }

  /* Keep the DMA channel and ring allocated so resume() is cheap; only the
   * transport and the converter are halted.
   */

  /* Serialize against ring_buffer_read() and the upper callback while the
   * DMA/ADC registers are stopped.  A pending completion is consumed after
   * unlock and ignored because streaming is false.
   */

  nxmutex_lock(&priv->worker_lock);
  priv->streaming = false;
  bk7258_mic_hw_stop(priv);
  priv->state = BK7258_MIC_STATE_PAUSED;
  nxmutex_unlock(&priv->worker_lock);

  return OK;
}

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_mic_resume(struct audio_lowerhalf_s *dev, void *session)
#else
static int bk7258_mic_resume(struct audio_lowerhalf_s *dev)
#endif
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  int ret;

  DEBUGASSERT(priv != NULL);

  if (priv->state != BK7258_MIC_STATE_PAUSED)
    {
      return OK;
    }

  /* Keep the worker out while stale completions and ring pointers from the
   * pre-pause stream are discarded and the hardware is restarted.
   */

  nxmutex_lock(&priv->worker_lock);

  while (nxsem_trywait(&priv->dmasem) >= 0);

  ret = bk7258_mic_hw_start(priv);
  if (ret < 0)
    {
      priv->streaming = false;
      nxmutex_unlock(&priv->worker_lock);
      return ret;
    }

  priv->streaming = true;
  priv->state = BK7258_MIC_STATE_RUNNING;
  nxmutex_unlock(&priv->worker_lock);
  return OK;
}
#endif

/****************************************************************************
 * Name: bk7258_mic_shutdown
 ****************************************************************************/

static int bk7258_mic_shutdown(struct audio_lowerhalf_s *dev)
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;

  DEBUGASSERT(priv != NULL);

  /* audio_close() invokes shutdown while holding the upper-half spinlock.
   * The supported bridge always performs STOP and RELEASE first; that path
   * publishes close_safe only after workers, buffers and the AP-wide AUD
   * session owner are gone.  Never take a sleeping mutex from last-close.
   */

  return __atomic_load_n(&priv->close_safe, __ATOMIC_ACQUIRE) ? OK :
         -EBUSY;
}

/****************************************************************************
 * Name: bk7258_mic_enqueuebuffer
 ****************************************************************************/

static int bk7258_mic_enqueuebuffer(struct audio_lowerhalf_s *dev,
                                    struct ap_buffer_s *apb)
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  struct dq_entry_s *entry;

  if (priv == NULL || apb == NULL || apb->samp == NULL ||
      apb->nmaxbytes < BK7258_MIC_BYTES_PER_SAMPLE)
    {
      return -EINVAL;
    }

  apb->nbytes  = 0;
  apb->curbyte = 0;

  nxmutex_lock(&priv->lock);

  if (!priv->reserved)
    {
      nxmutex_unlock(&priv->lock);
      return -EACCES;
    }

  for (entry = dq_peek(&priv->pendq); entry != NULL;
       entry = dq_next(entry))
    {
      if (entry == &apb->dq_entry)
        {
          nxmutex_unlock(&priv->lock);
          return -EALREADY;
        }
    }

  dq_addlast(&apb->dq_entry, &priv->pendq);
  nxmutex_unlock(&priv->lock);

  return OK;
}

/****************************************************************************
 * Name: bk7258_mic_cancelbuffer
 ****************************************************************************/

static int bk7258_mic_cancelbuffer(struct audio_lowerhalf_s *dev,
                                   struct ap_buffer_s *apb)
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  struct dq_entry_s *entry;
  bool found = false;

  if (priv == NULL || apb == NULL)
    {
      return -EINVAL;
    }

  nxmutex_lock(&priv->lock);

  for (entry = dq_peek(&priv->pendq); entry != NULL;
       entry = dq_next(entry))
    {
      if (entry == &apb->dq_entry)
        {
          dq_rem(entry, &priv->pendq);
          found = true;
          break;
        }
    }

  nxmutex_unlock(&priv->lock);

  if (!found)
    {
      return -ENOENT;
    }

#ifdef CONFIG_AUDIO_MULTI_SESSION
  priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb,
                  OK, priv);
#else
  priv->dev.upper(priv->dev.priv, AUDIO_CALLBACK_DEQUEUE, apb,
                  OK);
#endif

  return OK;
}

/****************************************************************************
 * Name: bk7258_mic_ioctl
 ****************************************************************************/

static int bk7258_mic_ioctl(struct audio_lowerhalf_s *dev, int cmd,
                            unsigned long arg)
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  int ret = OK;

  if (priv == NULL)
    {
      return -EINVAL;
    }

  switch (cmd)
    {
#ifdef CONFIG_AUDIO_DRIVER_SPECIFIC_BUFFERS
      case AUDIOIOC_GETBUFFERINFO:
        {
          struct ap_buffer_info_s *info = (struct ap_buffer_info_s *)arg;

          if (info == NULL)
            {
              return -EINVAL;
            }

          info->buffer_size = BK7258_MIC_FRAME_BYTES * priv->channels;
          info->nbuffers    = CONFIG_BK7258_MIC_RING_FRAMES;
        }
        break;
#endif

#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
      case BK7258_AUDIOIOC_GET_MIC_PREPROCESS:
        ret = bk7258_audio_preprocess_get_diag(
          (struct bk7258_audio_preprocess_diag_s *)arg);
        break;
#endif

      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: bk7258_mic_reserve / bk7258_mic_release
 ****************************************************************************/

/* The pinned v3.1.1.9 audio pipeline holds PM_DEV_ID_AUDIO at OPP480 while
 * its DSP path is active.  DAC already mirrors that contract.  MIC must do
 * the same once AEC/AGC runs synchronously in its capture worker; at the
 * 120-MHz idle OPP, one 20-ms AEC frame takes about four frame periods.
 */

