open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_mic.c
static int bk7258_mic_frequency_acquire(struct bk7258_mic_dev_s *priv)
{
  uint32_t active;
  int ret;

  ret = bk7258_pm_frequency_vote(BK7258_PM_FREQ_CLIENT_AUDIO,
                                 BK7258_PM_OPP_480M);
  if (ret < 0)
    {
      /* CP may have committed the vote before AP loses the reply.  Preserve
       * uncertain ownership so cleanup always sends an idempotent DEFAULT.
       */

      nxmutex_lock(&priv->lock);
      priv->frequency_uncertain = true;
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  active = (uint32_t)perf_getfreq();
  nxmutex_lock(&priv->lock);
  priv->frequency_voted = true;
  priv->frequency_uncertain = false;
  nxmutex_unlock(&priv->lock);

  if (active != BK7258_MIC_REQUIRED_CPU_HZ)
    {
      return -EIO;
    }

  return OK;
}

static int bk7258_mic_frequency_release(struct bk7258_mic_dev_s *priv)
{
  int ret;

  nxmutex_lock(&priv->lock);
  if (!priv->frequency_voted && !priv->frequency_uncertain)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  nxmutex_unlock(&priv->lock);
  ret = bk7258_pm_frequency_vote(BK7258_PM_FREQ_CLIENT_AUDIO,
                                 BK7258_PM_OPP_DEFAULT);
  if (ret < 0)
    {
      return ret;
    }

  nxmutex_lock(&priv->lock);
  priv->frequency_voted = false;
  priv->frequency_uncertain = false;
  nxmutex_unlock(&priv->lock);
  return OK;
}

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_mic_reserve(struct audio_lowerhalf_s *dev,
                              void **psession)
#else
static int bk7258_mic_reserve(struct audio_lowerhalf_s *dev)
#endif
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  int cleanup_ret;
  int session_ret;
  int ret;

  DEBUGASSERT(priv != NULL);

#ifdef CONFIG_AUDIO_MULTI_SESSION
  if (psession != NULL)
    {
      *psession = NULL;
    }
  else
    {
      return -EINVAL;
    }
#endif

  /* Serialize the blocking AP/CP power and frequency transactions with every
   * START/RELEASE transition.  Publish reserved only after both are proven.
   */

  nxmutex_lock(&priv->worker_lock);
  nxmutex_lock(&priv->lock);

  if (priv->reserved || priv->audio_session_owned ||
      priv->frequency_voted || priv->frequency_uncertain)
    {
      nxmutex_unlock(&priv->lock);
      nxmutex_unlock(&priv->worker_lock);
      return -EBUSY;
    }

  nxmutex_unlock(&priv->lock);

  ret = bk7258_media_audio_session_acquire(BK7258_MEDIA_AUDIO_MIC);
  if (ret < 0)
    {
      nxmutex_unlock(&priv->worker_lock);
      return ret;
    }

  nxmutex_lock(&priv->lock);
  priv->audio_session_owned = true;
  __atomic_store_n(&priv->close_safe, false, __ATOMIC_RELEASE);
  nxmutex_unlock(&priv->lock);

  ret = bk7258_mic_frequency_acquire(priv);
  if (ret < 0)
    {
      cleanup_ret = bk7258_mic_frequency_release(priv);
      session_ret = OK;
      if (cleanup_ret == OK && !priv->frequency_voted &&
          !priv->frequency_uncertain)
        {
          session_ret = bk7258_media_audio_session_release(
            BK7258_MEDIA_AUDIO_MIC);
          if (session_ret == OK)
            {
              priv->audio_session_owned = false;
            }
        }

      nxmutex_lock(&priv->lock);
      if (cleanup_ret < 0 || priv->frequency_voted ||
          priv->frequency_uncertain || session_ret < 0)
        {
          /* Keep RELEASE admissible so a caller can retry convergence. */

          priv->reserved = true;
          __atomic_store_n(&priv->close_safe, false, __ATOMIC_RELEASE);
        }
      else
        {
          __atomic_store_n(&priv->close_safe, true, __ATOMIC_RELEASE);
        }

      nxmutex_unlock(&priv->lock);
      nxmutex_unlock(&priv->worker_lock);
      return cleanup_ret < 0 ? cleanup_ret :
             session_ret < 0 ? session_ret : ret;
    }

  nxmutex_lock(&priv->lock);
  priv->reserved = true;
  dq_init(&priv->pendq);
  nxmutex_unlock(&priv->lock);
  nxmutex_unlock(&priv->worker_lock);

#ifdef CONFIG_AUDIO_MULTI_SESSION
  if (psession != NULL)
    {
      *psession = priv;
    }
#endif

  return OK;
}

#ifdef CONFIG_AUDIO_MULTI_SESSION
static int bk7258_mic_release(struct audio_lowerhalf_s *dev, void *session)
#else
static int bk7258_mic_release(struct audio_lowerhalf_s *dev)
#endif
{
  struct bk7258_mic_dev_s *priv = (struct bk7258_mic_dev_s *)dev;
  int session_ret;
  int ret;

  DEBUGASSERT(priv != NULL);

#ifdef CONFIG_AUDIO_MULTI_SESSION
  if (session != priv)
    {
      return -EINVAL;
    }
#endif

  if (priv->state == BK7258_MIC_STATE_RUNNING ||
      priv->state == BK7258_MIC_STATE_PAUSED)
    {
#ifdef CONFIG_AUDIO_MULTI_SESSION
      ret = bk7258_mic_stop(dev, session);
#else
      ret = bk7258_mic_stop(dev);
#endif
      if (ret < 0)
        {
          return ret;
        }
    }

  nxmutex_lock(&priv->lock);

  if (!priv->reserved && !priv->frequency_voted &&
      !priv->frequency_uncertain && !priv->audio_session_owned)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

  /* Close the enqueue gate before draining.  Otherwise an enqueue can land
   * after flush_pending() observes an empty queue but before reserved is
   * cleared, leaving a buffer that no owner can ever recover.
   */

  priv->reserved = false;
  nxmutex_unlock(&priv->lock);

  /* Join a buffer already removed from pendq by the capture worker, then
   * keep the worker excluded while every remaining buffer is returned.  No
   * new enqueue can pass the gate above, and the worker cannot race the
   * final drain by reacquiring worker_lock between a join and the flush.
   */

  nxmutex_lock(&priv->worker_lock);
  bk7258_mic_flush_pending(priv);

  ret = bk7258_mic_frequency_release(priv);
  if (ret == OK && priv->audio_session_owned)
    {
      session_ret = bk7258_media_audio_session_release(
        BK7258_MEDIA_AUDIO_MIC);
      if (session_ret < 0)
        {
          ret = session_ret;
        }
      else
        {
          priv->audio_session_owned = false;
        }
    }

  nxmutex_lock(&priv->lock);
  if (ret == OK && !priv->frequency_voted &&
      !priv->frequency_uncertain && !priv->audio_session_owned)
    {
      __atomic_store_n(&priv->close_safe, true, __ATOMIC_RELEASE);
    }

  nxmutex_unlock(&priv->lock);
  nxmutex_unlock(&priv->worker_lock);

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_mic_initialize
 *
 * Description:
 *   Publish the on-board microphone as /dev/audio/<devname>.  Idempotent.
 *
 ****************************************************************************/

int bk7258_mic_initialize(
  FAR const struct bk7258_mic_config_s *config)
{
  struct bk7258_mic_dev_s *priv = &g_bk7258_mic;
  int ret;

  if (g_bk7258_mic_registered)
    {
      return OK;
    }

  priv->dev.ops    = &g_bk7258_mic_ops;
  priv->samplerate = BK7258_MIC_RATE_16000;
  __atomic_store_n(&priv->close_safe, true, __ATOMIC_RELEASE);

  if (config == NULL || config->channels < 1 ||
      config->channels > BK7258_MIC_FIFO_CHANNELS ||
      (config->flags & BK7258_MIC_INPUT_MIC1) == 0 ||
      ((config->flags & BK7258_MIC_INPUT_MIC2) != 0) !=
        (config->channels == 2) ||
      (bk7258_mic_has_aec_reference(config) &&
       ((config->flags & BK7258_MIC_INPUT_MIC2) == 0 ||
        config->channels != 2 || config->aec_delay_samples > 1000u)) ||
      config->mic1_ana_gain > BK7258_MIC_ANA_GAIN_MAX ||
      config->mic2_ana_gain > BK7258_MIC_ANA_GAIN_MAX ||
      config->digital_gain_db < -(int)BK7258_MIC_DIG_GAIN_0DB ||
      config->digital_gain_db >
        (int)(BK7258_MIC_DIG_GAIN_MAX - BK7258_MIC_DIG_GAIN_0DB))
    {
      auderr("ERROR: BK7258 microphone configuration is invalid\n");
      return -EINVAL;
    }

  priv->config    = config;
  priv->channels  = config->channels;
  priv->dig_gain = (uint8_t)((int)BK7258_MIC_DIG_GAIN_0DB +
                            config->digital_gain_db);
  priv->mic1_ana_gain = config->mic1_ana_gain;
  priv->mic2_ana_gain = config->mic2_ana_gain;
  priv->dma_id     = DMA_ID_MAX + 1;   /* Not a valid channel */
  priv->pid        = -1;
  priv->state      = BK7258_MIC_STATE_RESET;
  priv->reserved   = false;
#ifdef CONFIG_BK7258_AUDIO_PREPROCESS
  priv->preprocess_ready = false;
#endif

  dq_init(&priv->pendq);
  ret = nxsem_init(&priv->dmasem, 0, 0);
  if (ret < 0)
    {
      return ret;
    }

  ret = nxsem_init(&priv->donesem, 0, 0);
  if (ret < 0)
    {
      nxsem_destroy(&priv->dmasem);
      return ret;
    }

  ret = audio_register(CONFIG_BK7258_MIC_DEVNAME, &priv->dev);
  if (ret < 0)
    {
      auderr("ERROR: audio_register(%s) failed: %d\n",
             CONFIG_BK7258_MIC_DEVNAME, ret);
      nxsem_destroy(&priv->dmasem);
      nxsem_destroy(&priv->donesem);
      return ret;
    }

  g_bk7258_mic_registered = true;

#ifdef CONFIG_BK7258_MIC_LIFECYCLE_VALIDATION
  ret = bk7258_mic_validation_start(config);
#endif

  return OK;
}

#endif /* CONFIG_BK7258_MIC */
